ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ДоговорЗаявка/ЖБИ_ДоговорЗаявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖБИ_ДоговорЗаявка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус</comment>
    <type>
      <types>EnumRef.ЖБИ_СтатусРасчетаСтавки</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЖБИ_ФактическиеОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>Покупатель</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктНазначения</name>
    <comment>Пункт назначения</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныеЛицаПокупателя</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаАвто</name>
      <comment>Норма погрузки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <comment>Вес, т</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <comment>Общий вес, т</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктОтгрузки</name>
      <comment>Пункт отгрузки</comment>
      <type>
        <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <comment>Пункт назначения</comment>
      <type>
        <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеЛицаПоставщика</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупатель</name>
      <comment>Покупатель</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеЛицаПокупателя</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НумераторПоПеревозчикам/ЖБИ_НумераторПоПеревозчикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_НумераторПоПеревозчикам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументПеревозчика</name>
    <type>
      <types>DocumentRef.ЖБИ_ДоговорЗаявка</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорПеревозки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ДоговорЗаявка/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЖБИ_ФактическиеОтгрузки") Тогда
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		//ЭтотОбъект.УстановитьНовыйНомер();
		//ЭтотОбъект.Дата = ТекущаяДатаСеанса();
		//ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		//Товары.Загрузить(ДанныеЗаполнения.СчетНаОплату.Выгрузить());
		//Статус = Перечисления.ЖБИ_СтатусРасчетаСтавки.Расчет;
	Иначе
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ можно добавить только на основании Фактические отгрузки");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	НомерПоПорядку  = 0;
	Запрос 		 	= Новый Запрос;
	Запрос.УстановитьПараметр("Перевозчик",Перевозчик);	
	Запрос.УстановитьПараметр("ДоговорПеревозки",Договор);
	Запрос.Текст = "ВЫБРАТЬ
					|	ЕСТЬNULL(МАКСИМУМ(ЖБИ_НумераторПоПеревозчикамСрезПоследних.НомерПоПорядку), 0) КАК НомерПоПорядку
					|ИЗ
					|	РегистрСведений.ЖБИ_НумераторПоПеревозчикам.СрезПоследних(,Партнер = &Перевозчик И ДоговорПеревозки = &ДоговорПеревозки) КАК ЖБИ_НумераторПоПеревозчикамСрезПоследних";		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		НомерПоПорядку = РезультатЗапроса.НомерПоПорядку
	КонецЕсли;
	
	Если НомерЗаявки > НомерПоПорядку Тогда
		СообщениеОбОшибки	= "";
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Период",ТекущаяДатаСеанса());
		СтруктураПараметров.Вставить("Партнер",Перевозчик);
		СтруктураПараметров.Вставить("ДоговорПеревозки",Договор);
		СтруктураПараметров.Вставить("НомерПоПорядку",НомерЗаявки); 
		СтруктураПараметров.Вставить("ДокументПеревозчика",Ссылка);
		СтруктураПараметров.Вставить("Автор",Пользователи.ТекущийПользователь());
		ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_НумераторПоПеревозчикам.ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров);	
		Результат 			 = РегистрыСведений.ЖБИ_НумераторПоПеревозчикам.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибки);
		Если Не Результат Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибки);
		КонецЕсли;		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Перевозчик",Перевозчик);	
	Запрос.УстановитьПараметр("ДоговорПеревозки",Договор);
	Запрос.УстановитьПараметр("НомерЗаявки",НомерЗаявки);
	Запрос.УстановитьПараметр("ТекущаяСсылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖБИ_ДоговорЗаявка.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЖБИ_ДоговорЗаявка КАК ЖБИ_ДоговорЗаявка
	               |ГДЕ
	               |	ЖБИ_ДоговорЗаявка.Перевозчик = &Перевозчик
	               |	И ЖБИ_ДоговорЗаявка.Договор = &ДоговорПеревозки
	               |	И ЖБИ_ДоговорЗаявка.НомерЗаявки = &НомерЗаявки
	               |	И ЖБИ_ДоговорЗаявка.Ссылка <> &ТекущаяСсылка
	               |	И НЕ ЖБИ_ДоговорЗаявка.ДокументОснование.ПометкаУдаления";	
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор заявка № " + Договор.Номер + "-" + НомерЗаявки + " уже существует " + РезультатЗапроса.Ссылка + " введите другой № заявки");
	КонецЕсли;
	
КонецПроцедуры
